Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm (LSTM)                  (None, 256)               287744    
_________________________________________________________________
repeat_vector (RepeatVector) (None, 29, 256)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 29, 256)           525312    
_________________________________________________________________
lstm_2 (LSTM)                (None, 29, 256)           525312    
_________________________________________________________________
lstm_3 (LSTM)                (None, 29, 256)           525312    
_________________________________________________________________
lstm_4 (LSTM)                (None, 29, 256)           525312    
_________________________________________________________________
dense (Dense)                (None, 29, 24)            6168      
=================================================================
Total params: 2,395,160
Trainable params: 2,395,160
Non-trainable params: 0
_________________________________________________________________


factors_expansion.h5 is a model trained on 30 epochs.